app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Matrix"], ["rating", "R"], ["release_date", "2015-06-26 00:00:00.000000"], ["created_at", "2015-06-26 00:38:27.189838"], ["updated_at", "2015-06-26 00:38:27.189838"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
---
  def destroy
    @movie.destroy!